## Importing and exporting data: read_csv and read_excel

In [3]:
# Import Pandas
import pandas as pd

In [4]:
# Read data from a CSV file

data_csv=pd.read_csv("data.csv")
# Insert another column as ID
data_csv.insert(0,'ID',range(1,len(data_csv)+1))

In [5]:
# Print csv data
print(data_csv)

    ID     Name  Age  Gender           City  Salary
0    1    Alice   25  Female       New York   60000
1    2      Bob   30    Male  San Francisco   80000
2    3  Charlie   22    Male    Los Angeles   55000
3    4    David   28    Male        Chicago   75000
4    5      Eve   35  Female         Boston   90000
5    6    Frank   29    Male        Seattle   72000
6    7    Grace   31  Female         Austin   85000
7    8   Hannah   26  Female         Denver   68000
8    9    Isaac   27    Male          Miami   62000
9   10    Julia   24  Female       Portland   57000
10  11    Karen   33  Female        Houston   78000
11  12     Liam   23    Male         Dallas   60000
12  13    Megan   29  Female        Phoenix   71000
13  14     Noah   32    Male        Atlanta   84000
14  15   Olivia   28  Female        Chicago   78000
15  16    Peter   25    Male         Boston   65000
16  17    Quinn   29    Male        Seattle   72000
17  18   Rachel   27  Female  San Francisco   95000
18  19      Sam   30    Male    Los Angeles   58000
19  20   Taylor   26    Male         Denver   71000
20  21      Uma   24  Female       New York   67000
21  22    Vince   31    Male          Miami   74000
22  23    Wendy   34  Female        Houston   89000
23  24   Xander   28    Male         Dallas   62000
24  25     Yara   23  Female         Austin   61000
25  26     Zane   25    Male        Phoenix   66000

In [ ]:
# Export to csv with ID
data_csv.to_csv("data_id.csv",index=Fasle)

In [6]:
#  Read data from an excel file
data_excel=pd.read_excel("student_data.xlsx")

In [7]:
# Print the response
print(data_excel)

   StudentID        Name  Age  Gender  Score
0      ST001   Student 1   20  Female     55
1      ST002   Student 2   18    Male     56
2      ST003   Student 3   23    Male     99
3      ST004   Student 4   22    Male     57
4      ST005   Student 5   23  Female     98
5      ST006   Student 6   25    Male     67
6      ST007   Student 7   22  Female     73
7      ST008   Student 8   25  Female     74
8      ST009   Student 9   20  Female     84
9      ST010  Student 10   23    Male     77
10     ST011  Student 11   19    Male     99
11     ST012  Student 12   19    Male     78
12     ST013  Student 13   20  Female     75
13     ST014  Student 14   25  Female     84
14     ST015  Student 15   18  Female     99
15     ST016  Student 16   25  Female     67
16     ST017  Student 17   23    Male     88
17     ST018  Student 18   21    Male     62
18     ST019  Student 19   18    Male    100
19     ST020  Student 20   21    Male     53

In [8]:
# Insert another column as ID
data_excel.insert(0,'ID',range(1,len(data_excel)+1))

In [9]:
# Print the result
print(data_excel)

    ID StudentID        Name  Age  Gender  Score
0    1     ST001   Student 1   20  Female     55
1    2     ST002   Student 2   18    Male     56
2    3     ST003   Student 3   23    Male     99
3    4     ST004   Student 4   22    Male     57
4    5     ST005   Student 5   23  Female     98
5    6     ST006   Student 6   25    Male     67
6    7     ST007   Student 7   22  Female     73
7    8     ST008   Student 8   25  Female     74
8    9     ST009   Student 9   20  Female     84
9   10     ST010  Student 10   23    Male     77
10  11     ST011  Student 11   19    Male     99
11  12     ST012  Student 12   19    Male     78
12  13     ST013  Student 13   20  Female     75
13  14     ST014  Student 14   25  Female     84
14  15     ST015  Student 15   18  Female     99
15  16     ST016  Student 16   25  Female     67
16  17     ST017  Student 17   23    Male     88
17  18     ST018  Student 18   21    Male     62
18  19     ST019  Student 19   18    Male    100
19  20     ST020  Student 20   21    Male     53

In [ ]:
# Export to excel with ID
data_excel.to_excel("student_data_id.xlsx",index=False)